* Barnes_T020_1979

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Barnes_T020_1979
Place name                       | Barnes Ice Cap
Geographic location              | Canadian Arctic South
Ice type                         | Ice cap
Data Source                      | Graphic in science source
Data DOI                         | 
Science Source                   | Hooke, Roger LeB., Alexander, E. Calvin, Gustafson, Robert J.: Temperature profiles in the Barnes Ice Cap, Baffin Island, Canada, and heat flux from the subglacial terrane , Canadian Journal of Earth Sciences 17(9), Canadian Science Publishing, 1174–1188, sep 1980
Science DOI                      | 10.1139/e80-124
Date                             | 1979-07-02
Longitude [°E]                   | -71.892
Latitude [°N]                    | 69.71965
Location Source                  | Location digitized by M. Jacquemart from Gilbert (2016)
Depth of top measurement [m]     | 0.0
Depth of bottom measurement [m]  | 279
Ice thickness [m]                | 369
Coverage [% of thickness]        | 76
Ice thickness source             | See science source
Note                             | "Date is ""Date completed"" from Hooke (1980) Table 1 Column 2 + Days to final measurement (Column 3); Temperature and location digitized by M. Jacquemart from Gilbert (2016)"
#+end_example


** Temperature

+ Any notes on source or data
+ Links to key papers

** Thickness

+ Notes on thickness
 
** Location

+ Notes on location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS: ingest_data
|          t |         d |
| -10.161963 | 0.2973241 |
|  -9.268712 |  41.32805 |
| -8.6588955 |   65.4113 |
|  -8.280982 | 86.818634 |
|  -7.988957 | 103.46878 |
|       -7.8 | 117.74033 |
| -7.4993863 | 144.20218 |
| -7.2760735 | 165.01486 |
| -7.0269938 | 185.23291 |
|  -6.838037 | 202.18037 |
|  -6.537423 | 227.75024 |
| -6.1509204 | 254.50941 |
| -5.7558284 | 279.48465 |


